
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>前置知识 · 函数调用原理</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="codercat">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-anchors/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="control-transfer.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="pre-knowledge.html">
            
                <a href="pre-knowledge.html">
            
                    
                    前置知识
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="control-transfer.html">
            
                <a href="control-transfer.html">
            
                    
                    控制转移
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="data-transfer.html">
            
                <a href="data-transfer.html">
            
                    
                    数据传递
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="save-and-restore-of-registers.html">
            
                <a href="save-and-restore-of-registers.html">
            
                    
                    寄存器的保存与恢复
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="storage-of-local-variables.html">
            
                <a href="storage-of-local-variables.html">
            
                    
                    局部变量的存储
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="function-stack-frame.html">
            
                <a href="function-stack-frame.html">
            
                    
                    函数栈帧
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="c-stack-frame-example.html">
            
                <a href="c-stack-frame-example.html">
            
                    
                    C语言函数栈帧实例
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="interesting-example.html">
            
                <a href="interesting-example.html">
            
                    
                    一个有趣的例子
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="modify-stack-frame-data.html">
            
                <a href="modify-stack-frame-data.html">
            
                    
                    手动修改栈帧数据
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >前置知识</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x524D;&#x7F6E;&#x77E5;&#x8BC6;"><a name="&#x524D;&#x7F6E;&#x77E5;&#x8BC6;" class="plugin-anchor" href="#&#x524D;&#x7F6E;&#x77E5;&#x8BC6;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x524D;&#x7F6E;&#x77E5;&#x8BC6;</h1>
<blockquote>
<p>&#x5728;&#x8FD9;&#x91CC;&#x5148;&#x719F;&#x6089;&#x4E00;&#x4E0B;&#x672C;&#x6587;&#x4E2D;&#x4F1A;&#x9047;&#x5230;&#x7684;&#x672F;&#x8BED;&#x3002;</p>
</blockquote>
<h2 id="&#x51FD;&#x6570;&#x5B9A;&#x4E49;"><a name="&#x51FD;&#x6570;&#x5B9A;&#x4E49;" class="plugin-anchor" href="#&#x51FD;&#x6570;&#x5B9A;&#x4E49;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x51FD;&#x6570;&#x5B9A;&#x4E49;</h2>
<blockquote>
<p>&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#x51FD;&#x6570;&#xFF08;&#x6709;&#x65F6;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x8FC7;&#x7A0B;&#x6216;&#x65B9;&#x6CD5;&#xFF09;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;<code>&#x5C01;&#x88C5;&#x4EE3;&#x7801;</code>&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x7528;&#x4E00;&#x7EC4;&#x6307;&#x5B9A;&#x7684;&#x53C2;&#x6570;&#x548C;&#x53EF;&#x9009;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x5B9E;&#x73B0;&#x4E86;&#x67D0;&#x79CD;&#x529F;&#x80FD;&#x3002;&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x5728;&#x7A0B;&#x5E8F;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x3002;&#x5B83;&#x901A;&#x8FC7;&#x4ECE;<code>&#x8C03;&#x7528;&#x65B9;</code>&#x63A5;&#x53D7;&#x4E00;&#x7EC4;&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x51FD;&#x6570;&#x6267;&#x884C;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5411;<code>&#x88AB;&#x8C03;&#x7528;&#x65B9;</code>&#x8FD4;&#x56DE;&#x6267;&#x884C;&#x7ED3;&#x679C;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x8FDB;&#x884C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5E95;&#x5C42;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x5982;&#x4E0B;&#x673A;&#x5236;&#xFF1A;</p>
<ul>
<li><p>&#x63A7;&#x5236;&#x8F6C;&#x79FB;</p>
<p>&#x9700;&#x8981;&#x628A;<code>&#x63A7;&#x5236;&#x8F6C;&#x79FB;</code>&#x5230;&#x88AB;&#x8C03;&#x7528;&#x51FD;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x5F53;&#x88AB;&#x8C03;&#x7528;&#x51FD;&#x6570;<code>&#x6267;&#x884C;&#x5B8C;&#x6BD5;</code>&#x540E;&#x518D;&#x56DE;&#x5230;&#x539F;&#x6765;&#x7684;&#x4F4D;&#x7F6E;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;</p>
</li>
<li><p>&#x6570;&#x636E;&#x4F20;&#x9012;</p>
<p>&#x8C03;&#x7528;&#x8005;&#x53EF;&#x4EE5;&#x5411;&#x88AB;&#x8C03;&#x7528;&#x8005;<code>&#x4F20;&#x9012;&#x53C2;&#x6570;</code>&#xFF0C;&#x540C;&#x65F6;&#x88AB;&#x8C03;&#x7528;&#x8005;&#x4E5F;&#x53EF;&#x4EE5;&#x5411;&#x8C03;&#x7528;&#x8005;<code>&#x8FD4;&#x56DE;&#x6570;&#x636E;</code>&#x3002;</p>
</li>
<li><p>&#x5185;&#x5B58;&#x5206;&#x914D;&#x4E0E;&#x91CA;&#x653E;</p>
<p>&#x5728;&#x5F00;&#x59CB;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4E3A;&#x88AB;&#x8C03;&#x7528;&#x8005;&#x5206;&#x914D;<code>&#x5C40;&#x90E8;&#x5185;&#x5B58;</code>&#x6765;&#x5B58;&#x50A8;<code>&#x5C40;&#x90E8;&#x53D8;&#x91CF;</code>&#xFF0C;&#x5728;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x65F6;&#x5FC5;&#x987B;&#x5BF9;&#x8FD9;&#x4E9B;&#x5185;&#x5B58;&#x8FDB;&#x884C;&#x91CA;&#x653E;&#x3002;</p>
</li>
</ul>
<h2 id="&#x6808;"><a name="&#x6808;" class="plugin-anchor" href="#&#x6808;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x6808;</h2>
<p>&#x6808;&#x662F;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x7406;&#x89E3;&#x4E3A;&#x4E00;&#x4E2A;&#x5BB9;&#x7EB3;&#x6570;&#x636E;&#x7684;&#x5BB9;&#x5668;&#xFF0C;&#x5B83;&#x5177;&#x6709;<code>&#x5148;&#x8FDB;&#x540E;&#x51FA;</code>&#xFF08;&#x4E5F;&#x7B49;&#x4EF7;&#x4E8E;&#x540E;&#x8FDB;&#x5148;&#x51FA;&#xFF09;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5148;&#x8FDB;&#x5165;<code>&#x6808;</code>&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6700;&#x540E;&#x624D;&#x80FD;&#x51FA;&#x6765;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x60F3;&#x8C61;&#x6210;&#x4F60;&#x684C;&#x9762;&#x7684;&#x4E00;&#x645E;&#x4E66;&#xFF0C;&#x6BCF;&#x6B21;&#x53EA;&#x80FD;&#x53D6;&#x6700;&#x4E0A;&#x9762;&#x7684;&#x4E00;&#x672C;&#x4E66;&#xFF0C;&#x65B0;&#x5230;&#x6765;&#x7684;&#x4E66;&#x53EA;&#x80FD;&#x653E;&#x5728;&#x6700;&#x4E0A;&#x9762;&#x3002;&#x6216;&#x8005;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x60F3;&#x50CF;&#x6210;&#x4F60;&#x8EAB;&#x4E0A;&#x7684;&#x8863;&#x670D;&#xFF0C;&#x6700;&#x5148;&#x7A7F;&#x7684;&#x8863;&#x670D;&#xFF0C;&#x6700;&#x540E;&#x624D;&#x80FD;&#x8131;&#x6389;&#x3002;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;<code>&#x6808;</code>&#x6765;&#x8BF4;&#x5C31;&#x6709;&#x4E24;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x64CD;&#x4F5C;&#x5373;<code>&#x538B;&#x6808;</code>&#xFF08;push&#xFF09;&#x548C;<code>&#x51FA;&#x6808;</code>&#xFF08;pop&#xFF09;&#x3002;<code>&#x538B;&#x6808;</code>&#x8868;&#x793A;&#x4ECE;&#x6808;&#x7684;&#x9876;&#x90E8;&#x65B0;&#x65B0;&#x589E;&#x4E00;&#x6761;&#x6570;&#x636E;&#xFF0C;<code>&#x51FA;&#x6808;</code>&#x8868;&#x793A;&#x628A;&#x6808;&#x9876;&#x90E8;&#x7684;&#x6570;&#x636E;&#x53D6;&#x51FA;&#x6765;&#x3002;&#x6808;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5177;&#x6709;<code>&#x8BB0;&#x5FC6;&#x529F;&#x80FD;</code>&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x51FA;&#x6808;&#x7684;&#x503C;&#x6C38;&#x8FDC;&#x662F;&#x6700;&#x8FD1;&#x88AB;&#x538B;&#x5165;&#x4E14;&#x4ECD;&#x7136;&#x5728;&#x6808;&#x4E2D;&#x7684;&#x503C;&#x3002;</p>
<h2 id="&#x5185;&#x5B58;"><a name="&#x5185;&#x5B58;" class="plugin-anchor" href="#&#x5185;&#x5B58;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x5185;&#x5B58;</h2>
<p>&#x5185;&#x5B58;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x4E00;&#x7EC4;<code>&#x8FDE;&#x7EED;&#x7684;</code>&#x5B58;&#x50A8;&#x533A;&#x57DF;&#xFF0C;&#x8FD9;&#x5757;&#x533A;&#x57DF;&#x88AB;&#x8BA1;&#x7B97;&#x673A;&#x7EC4;&#x7EC7;&#x6210;&#x7531;&#x65E0;&#x6570;&#x4E2A;&#x8FDE;&#x7EED;&#x7684;&#x4EE5;<code>&#x5B57;&#x8282;</code>&#xFF08;8&#x4E2A;&#x4E8C;&#x8FDB;&#x5236;&#x4F4D;&#xFF09;&#x5927;&#x5C0F;&#x4E3A;&#x5355;&#x5143;&#x7684;&#x96C6;&#x5408;&#x3002;&#x5E76;&#x4E14;&#x4E3A;&#x6BCF;&#x4E2A;<code>&#x5185;&#x5B58;&#x5355;&#x5143;</code>&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;<code>&#x5185;&#x5B58;&#x5730;&#x5740;</code>&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x65B9;&#x4FBF;&#x5BF9;&#x67D0;&#x4E2A;&#x5185;&#x5B58;&#x5355;&#x5143;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6BCF;&#x4E2A;&#x5B57;&#x8282;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;<code>&#x5185;&#x5B58;&#x5730;&#x5740;</code>&#x3002;&#x4F8B;&#x5982;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x5730;&#x5740;&#x662F;0&#xFF0C;&#x548C;&#x5B83;&#x6328;&#x7740;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x5B57;&#x8282;&#x5730;&#x5740;&#x5C31;&#x662F;1&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;&#x6211;&#x4EEC;&#x628A;&#x5185;&#x5B58;&#x5730;&#x5740;&#x8F83;&#x5927;&#x7684;&#x4E00;&#x7AEF;&#x79F0;&#x4F5C;<code>&#x9AD8;&#x5730;&#x5740;</code>&#xFF0C;&#x5185;&#x5B58;&#x5730;&#x5740;&#x8F83;&#x5C0F;&#x7684;&#x4E00;&#x7AEF;&#x79F0;&#x4F5C;<code>&#x4F4E;&#x5730;&#x5740;</code>&#x3002;</p>
<h2 id="&#x6C47;&#x7F16;&#x6307;&#x4EE4;"><a name="&#x6C47;&#x7F16;&#x6307;&#x4EE4;" class="plugin-anchor" href="#&#x6C47;&#x7F16;&#x6307;&#x4EE4;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x6C47;&#x7F16;&#x6307;&#x4EE4;</h2>
<p><code>&#x6C47;&#x7F16;&#x8BED;&#x8A00;</code>&#x662F;&#x76F4;&#x63A5;&#x5DE5;&#x4F5C;&#x5728;&#x673A;&#x5668;&#x4E4B;&#x4E0A;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x53EA;&#x80FD;&#x8BC6;&#x522B;&#x7531;0&#xFF0C;1&#x7EC4;&#x6210;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x5E8F;&#x5217;&#xFF0C;&#x6240;&#x4EE5;CPU&#x4E5F;&#x53EA;&#x80FD;&#x6267;&#x884C;&#x7531;0&#xFF0C;1&#x6240;&#x7EC4;&#x6210;&#x7684;<code>&#x673A;&#x5668;&#x6307;&#x4EE4;</code>&#x3002;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x662F;&#x673A;&#x5668;&#x6307;&#x4EE4;&#x7684;<code>&#x52A9;&#x5FC6;&#x7B26;</code>&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x4EBA;&#x7C7B;&#x8FA8;&#x522B;&#x548C;&#x8BB0;&#x5FC6;&#x3002;&#x6BCF;&#x4E00;&#x6761;&#x6C47;&#x7F16;&#x6307;&#x4EE4;&#x4F1A;&#x5BF9;&#x5E94;&#x4E00;&#x6761;&#x6216;&#x591A;&#x6761;&#x673A;&#x5668;&#x6307;&#x4EE4;&#x3002;&#x672C;&#x6587;&#x4E2D;&#x4F1A;&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x7C7B;&#x4F3C;&#x4E8E;C&#x8BED;&#x8A00;&#x7684;&#x4F2A;&#x4EE3;&#x7801;&#x6765;&#x63CF;&#x8FF0;&#x6808;&#x7684;&#x53D8;&#x5316;&#x8FC7;&#x7A0B;&#x3002;</p>
<h2 id="&#x5BC4;&#x5B58;&#x5668;"><a name="&#x5BC4;&#x5B58;&#x5668;" class="plugin-anchor" href="#&#x5BC4;&#x5B58;&#x5668;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x5BC4;&#x5B58;&#x5668;</h2>
<p><code>CPU</code>&#x7684;&#x5185;&#x90E8;&#x6709;&#x4E00;&#x7EC4;&#x5B58;&#x50A8;&#x5668;&#x7528;&#x6765;&#x5B58;&#x653E;&#x4E00;&#x4E9B;&#x8F83;&#x5C0F;&#x7684;&#x4E34;&#x65F6;&#x6570;&#x636E;&#xFF0C;&#x79F0;&#x8FD9;&#x7EC4;&#x5B58;&#x50A8;&#x5668;&#x4E3A;<code>&#x5BC4;&#x5B58;&#x5668;</code>&#xFF0C;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x6BD4;&#x5185;&#x5B58;&#x5FEB;&#x5F88;&#x591A;&#xFF0C;&#x901A;&#x8FC7;&#x5FEB;&#x901F;&#x5730;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x6765;&#x52A0;&#x901F;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#x3002;CPU&#x60F3;&#x8981;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5C31;&#x5FC5;&#x987B;&#x628A;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x8F6C;&#x79FB;&#x5230;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x7136;&#x540E;CPU&#x518D;&#x4ECE;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x8BFB;&#x53D6;&#x3002;&#x5BC4;&#x5B58;&#x5668;&#x4F4D;&#x4E8E;&#x5B58;&#x50A8;&#x5668;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x7684;&#x6700;&#x9876;&#x7AEF;&#xFF0C;&#x4E5F;&#x662F;CPU&#x53EF;&#x4EE5;&#x8BFB;&#x5199;&#x7684;&#x6700;&#x5FEB;&#x7684;&#x5B58;&#x50A8;&#x5668;&#x3002;&#x6BCF;&#x4E2A;&#x5BC4;&#x5B58;&#x5668;&#x6709;&#x4E13;&#x95E8;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x7528;&#x9014;&#x4E5F;&#x4E0D;&#x4E00;&#x6837;&#x3002;</p>
<h2 id="&#x5806;&#x6808;&#xFF08;&#x5185;&#x5B58;&#xFF09;"><a name="&#x5806;&#x6808;&#xFF08;&#x5185;&#x5B58;&#xFF09;" class="plugin-anchor" href="#&#x5806;&#x6808;&#xFF08;&#x5185;&#x5B58;&#xFF09;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x5806;&#x6808;&#xFF08;&#x5185;&#x5B58;&#xFF09;</h2>
<p>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4F1A;&#x4E3A;<code>&#x8FDB;&#x7A0B;</code>&#xFF08;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF09;&#x5206;&#x914D;<code>&#x5185;&#x5B58;&#x7A7A;&#x95F4;</code>&#x7528;&#x4E8E;&#x5B58;&#x653E;&#x7A0B;&#x5E8F;&#x5728;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x9700;&#x8981;&#x7684;&#x4EE3;&#x7801;&#x548C;&#x6570;&#x636E;&#x3002;&#x6839;&#x636E;&#x5185;&#x5B58;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x4E0D;&#x540C;&#xFF0C;&#x4F1A;&#x628A;&#x5185;&#x5B58;&#x5212;&#x5206;&#x6210;&#x51E0;&#x4E2A;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x529F;&#x80FD;&#x7684;&#x533A;&#x57DF;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x5757;&#x533A;&#x57DF;&#x53EB;&#x505A;<code>&#x5806;&#x6808;</code>&#xFF08;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x6808;&#xFF09;&#xFF0C;&#x5B83;&#x548C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x6808;&#x4E00;&#x6837;&#x5177;&#x6709;<code>&#x540E;&#x8FDB;&#x5148;&#x51FA;</code>&#x7684;&#x6027;&#x8D28;&#x3002;<code>&#x5806;&#x6808;</code>&#x7528;&#x4E8E;&#x8BB0;&#x5F55;&#x51FD;&#x6570;&#x5728;&#x8C03;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#x4EA7;&#x751F;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982;&#x51FD;&#x6570;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x548C;&#x53C2;&#x6570;&#x7B49;&#x4FE1;&#x606F;&#x3002;&#x672C;&#x6587;&#x540E;&#x9762;&#x63D0;&#x5230;&#x7684;<code>&#x6808;</code>&#x5747;&#x6307;&#x7684;&#x662F;&#x5185;&#x5B58;&#x4E2D;&#x7684;<code>&#x5806;&#x6808;</code>&#x3002;</p>
<p>CPU&#x63D0;&#x4F9B;&#x4E86;&#x5BF9;&#x6808;&#x5185;&#x5B58;&#x8FDB;&#x884C;<code>&#x538B;&#x6808;</code>&#xFF08;push&#xFF09;&#x548C;<code>&#x51FA;&#x6808;</code>&#xFF08;pop&#xFF09;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x53EB;&#x505A;<code>&#x6808;&#x6307;&#x9488;</code>&#xFF08;sp&#xFF09;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x7528;&#x6765;&#x4FDD;&#x5B58;<code>&#x6808;&#x9876;</code>&#x4F4D;&#x7F6E;&#x7684;<code>&#x5185;&#x5B58;&#x5730;&#x5740;</code>&#x3002;<code>&#x6808;&#x5185;&#x5B58;</code>&#x662F;&#x4ECE;<code>&#x9AD8;&#x5730;&#x5740;</code>&#x5411;<code>&#x4F4E;&#x5730;&#x5740;</code>&#x7A7A;&#x95F4;&#x53D1;&#x5C55;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x8DDF;&#x6B63;&#x5E38;&#x7684;&#x601D;&#x7EF4;&#x4E60;&#x60EF;&#x6709;&#x70B9;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5F53;&#x4F60;&#x5411;<code>&#x6808;</code>&#x4E2D;<code>push</code>&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x6808;&#x7684;&#x5730;&#x5740;&#x4F1A;&#x53D8;&#x5C0F;&#x3002;</p>
<p><strong>&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x8868;&#x793A;&#x672C;&#x6587;&#x540E;&#x9762;&#x7684;&#x6240;&#x6709;&#x6808;&#x7ED3;&#x6784;&#x56FE;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x683C;&#x5B50;&#x90FD;&#x662F;8&#x4E2A;&#x5B57;&#x8282; &#xFF0C;&#x540C;&#x65F6;&#x6211;&#x4EEC;&#x4E5F;&#x5047;&#x8BBE;push&#x548C;pop&#x6307;&#x4EE4;&#x6BCF;&#x6B21;&#x64CD;&#x4F5C;8&#x4E2A;&#x5B57;&#x8282;</strong>&#x3002;</p>
<p>&#x4E0B;&#x56FE;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x5C0F;&#x4E3A;80&#x4E2A;&#x5B57;&#x8282;&#xFF08;&#x56FE;&#x4E2D;&#x6BCF;&#x4E2A;&#x683C;&#x5B50;&#x662F;8&#x4E2A;&#x5B57;&#x8282;&#xFF09;&#x7684;<code>&#x6808;</code>&#xFF0C;&#x5730;&#x5740;&#x8303;&#x56F4;&#x662F;0~79&#x3002;<code>&#x6808;&#x6307;&#x9488;</code>&#x6307;&#x5411;&#x6808;&#x9876;&#x7684;&#x4F4D;&#x7F6E;&#xFF1A;</p>
<p><img src="https://image.coder.cat/stack1.png" alt=""></p>
<blockquote>
<p>&#x540E;&#x9762;&#x63D0;&#x5230;&#x7684;&#x6307;&#x4EE4;&#x5747;&#x662F;&#x7C7B;&#x4F3C;&#x4E8E;C&#x8BED;&#x8A00;&#x7684;&#x4F2A;&#x4EE3;&#x7801;&#xFF0C;&#x53EA;&#x662F;&#x7528;&#x6765;&#x63CF;&#x8FF0;&#x6808;&#x7684;&#x53D8;&#x5316;&#x8FC7;&#x7A0B;&#x3002;</p>
</blockquote>
<h3 id="&#x538B;&#x6808;"><a name="&#x538B;&#x6808;" class="plugin-anchor" href="#&#x538B;&#x6808;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x538B;&#x6808;</h3>
<p>&#x538B;&#x6808;&#x65F6;&#x628A;<code>&#x6808;&#x6307;&#x9488;</code>&#x5F80;<code>&#x4F4E;&#x5730;&#x5740;</code>&#x79FB;&#x52A8;&#x4E5F;&#x5C31;&#x662F;&#x51CF;&#x5C0F;&#x6808;&#x6307;&#x9488;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x6570;&#x636E;&#x5199;&#x5165;&#x5230;&#x4EE5;<code>&#x6808;&#x6307;&#x9488;</code>&#x5F00;&#x59CB;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#x8981;&#x628A;&#x6570;&#x503C;<code>123</code>&#x538B;&#x5165;&#x5230;&#x6808;&#x4E2D;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x6307;&#x4EE4;&#x5C31;&#x662F;&#xFF1A;</p>
<pre><code class="lang-c">push(<span class="hljs-number">123</span>);
</code></pre>
<p>&#x5B83;&#x7684;&#x6548;&#x679C;&#x7B49;&#x4EF7;&#x4E8E;&#x4E0B;&#x9762;&#x8FD9;&#x4E24;&#x6761;&#x6307;&#x4EE4;&#xFF1A;</p>
<pre><code class="lang-c">sp = sp - <span class="hljs-number">8</span>;
*sp = <span class="hljs-number">123</span>;
</code></pre>
<p>&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x5047;&#x8BBE;push&#x6307;&#x4EE4;&#x6BCF;&#x6B21;&#x64CD;&#x4F5C;8&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x6240;&#x4EE5;&#x7B2C;1&#x6761;&#x6307;&#x4EE4;&#x5148;&#x628A;<code>sp</code>&#xFF08;&#x6808;&#x6307;&#x9488;&#xFF09;&#x5411;&#x4F4E;&#x5730;&#x5740;&#x79FB;&#x52A8;8&#x4E2A;&#x5B57;&#x3002;&#x7136;&#x540E;&#x7B2C;2&#x6761;&#x6307;&#x4EE4;&#x518D;&#x628A;&#x6570;&#x636E;&#x5199;&#x5165;&#x5230;&#x4EE5;<code>sp</code>&#x5F00;&#x59CB;&#x7684;&#x90A3;8&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#x3002;<code>*sp</code>&#x8868;&#x793A;&#x7684;&#x662F;<code>&#x6808;&#x6307;&#x9488;</code>&#x6240;&#x6307;&#x5411;&#x7684;&#x90A3;&#x5757;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x800C;&#x4E0D;&#x662F;<code>&#x6808;&#x6307;&#x9488;</code>&#x672C;&#x8EAB;&#x3002;</p>
<p>&#x6808;&#x53D8;&#x5316;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p><img src="https://image.coder.cat/stack15.png" alt=""></p>
<h3 id="&#x51FA;&#x6808;"><a name="&#x51FA;&#x6808;" class="plugin-anchor" href="#&#x51FA;&#x6808;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x51FA;&#x6808;</h3>
<p>&#x51FA;&#x6808;&#x65F6;&#x5148;&#x53D6;&#x51FA;&#x4EE5;<code>&#x6808;&#x6307;&#x9488;</code>&#x5F00;&#x5934;&#x7684;8&#x4E2A;&#x5B57;&#x8282;&#xFF08;&#x6211;&#x4EEC;&#x5047;&#x8BBE;pop&#x6BCF;&#x6B21;&#x64CD;&#x4F5C;8&#x4E2A;&#x5B57;&#x8282;&#xFF09;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x518D;&#x628A;<code>&#x6808;&#x6307;&#x9488;</code>&#x5411;&#x9AD8;&#x5730;&#x5740;&#x79FB;&#x52A8;8&#x4E2A;&#x5B57;&#x8282;&#x4E5F;&#x5C31;&#x662F;&#x589E;&#x52A0;&#x6808;&#x6307;&#x9488;&#x3002;</p>
<p>&#x628A;&#x538B;&#x6808;&#x4F8B;&#x5B50;&#x4E2D;<code>&#x6808;&#x9876;</code>&#x7684;&#x6570;&#x636E;&#x51FA;&#x6808;&#x81F3;&#x53D8;&#x91CF;<code>rax</code>&#x4E2D;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x6307;&#x4EE4;&#xFF1A;</p>
<pre><code class="lang-c">pop(rax);
</code></pre>
<p>&#x5B83;&#x7684;&#x6548;&#x679C;&#x7B49;&#x4EF7;&#x4E8E;&#x4E0B;&#x9762;&#x8FD9;&#x4E24;&#x6761;&#x6307;&#x4EE4;&#xFF1A;</p>
<pre><code class="lang-c">rax = *sp;
sp = sp + <span class="hljs-number">8</span>;
</code></pre>
<p>&#x5148;&#x628A;&#x4EE5;<code>&#x6808;&#x6307;&#x9488;</code>&#x5F00;&#x59CB;&#x7684;8&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x6570;&#x636E;&#x653E;&#x5165;&#x53D8;&#x91CF;<code>rax</code>&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x538B;&#x6808;&#x4F8B;&#x5B50;&#x4E2D;&#x538B;&#x5165;&#x7684;&#x662F;123&#xFF0C;&#x6240;&#x4EE5;&#x6B64;&#x65F6;&#x51FA;&#x6808;&#x7684;&#x6570;&#x636E;&#x4E5F;&#x662F;123&#xFF0C;&#x6700;&#x540E;&#x628A;<code>&#x6808;&#x6307;&#x9488;</code>&#x5411;&#x9AD8;&#x5730;&#x5740;&#x79FB;&#x52A8;8&#x4E2A;&#x5B57;&#x8282;&#x3002;</p>
<p>&#x6808;&#x53D8;&#x5316;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p><img src="https://image.coder.cat/stack16.png" alt=""></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 介绍">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="control-transfer.html" class="navigation navigation-next " aria-label="Next page: 控制转移">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"前置知识","level":"1.2","depth":1,"next":{"title":"控制转移","level":"1.3","depth":1,"path":"control-transfer.md","ref":"control-transfer.md","articles":[]},"previous":{"title":"介绍","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","search","-sharing","anchors","highlight","code","hide-element"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"github":{"url":"https://github.com/acodercat/function-call-principle"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":false},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"anchor-navigation-ex":{"isRewritePageTitle":false},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"anchors":{}},"theme":"default","author":"codercat","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"函数调用原理","language":"zh-hans","gitbook":"*"},"file":{"path":"pre-knowledge.md","mtime":"2020-12-25T03:58:16.294Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-12-28T09:42:13.125Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

