
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>函数栈帧 · 函数调用原理</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="codercat">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-anchors/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="c-stack-frame-example.html" />
    
    
    <link rel="prev" href="storage-of-local-variables.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="pre-knowledge.html">
            
                <a href="pre-knowledge.html">
            
                    
                    前置知识
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="stack-in-memory.html">
            
                <a href="stack-in-memory.html">
            
                    
                    内存中的栈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="control-transfer.html">
            
                <a href="control-transfer.html">
            
                    
                    控制转移
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="data-transfer.html">
            
                <a href="data-transfer.html">
            
                    
                    数据传递
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="save-and-restore-of-registers.html">
            
                <a href="save-and-restore-of-registers.html">
            
                    
                    寄存器的保存与恢复
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="storage-of-local-variables.html">
            
                <a href="storage-of-local-variables.html">
            
                    
                    局部变量的存储
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.8" data-path="function-stack-frame.html">
            
                <a href="function-stack-frame.html">
            
                    
                    函数栈帧
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="c-stack-frame-example.html">
            
                <a href="c-stack-frame-example.html">
            
                    
                    C语言函数栈帧实例
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="interesting-example.html">
            
                <a href="interesting-example.html">
            
                    
                    一个有趣的例子
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="modify-stack-frame-data.html">
            
                <a href="modify-stack-frame-data.html">
            
                    
                    手动修改栈帧数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >函数栈帧</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x51FD;&#x6570;&#x6808;&#x5E27;"><a name="&#x51FD;&#x6570;&#x6808;&#x5E27;" class="plugin-anchor" href="#&#x51FD;&#x6570;&#x6808;&#x5E27;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x51FD;&#x6570;&#x6808;&#x5E27;</h1>
<blockquote>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x4E3A;&#x5B83;&#x5728;<code>&#x5806;&#x6808;</code>&#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;<code>&#x6808;&#x5E27;</code>&#xFF08;stack frame&#xFF09;&#x7528;&#x6765;&#x8BB0;&#x5F55;&#x8FD0;&#x884C;&#x65F6;&#x4EA7;&#x751F;&#x7684;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#xFF0C;&#x56E0;&#x6B64;&#x6BCF;&#x4E2A;&#x51FD;&#x6570;&#x5728;&#x6267;&#x884C;&#x524D;&#x90FD;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6808;&#x5E27;&#xFF0C;&#x5728;&#x5B83;&#x8FD4;&#x56DE;&#x65F6;&#x4F1A;&#x9500;&#x6BC1;&#x8BE5;&#x6808;&#x5E27;&#x3002;</p>
</blockquote>
<p><strong>&#x672C;&#x8282;&#x7684;&#x793A;&#x610F;&#x56FE;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x989C;&#x8272;&#x533A;&#x5206;&#x8C03;&#x7528;&#x8005;&#x4E0E;&#x88AB;&#x8C03;&#x7528;&#x8005;&#x7684;&#x6808;&#x5E27;&#xFF0C;&#x84DD;&#x8272;&#x8868;&#x793A;&#x88AB;&#x8C03;&#x7528;&#x8005;&#xFF0C;&#x7EFF;&#x8272;&#x8868;&#x793A;&#x8C03;&#x7528;&#x8005;&#x3002;</strong></p>
<h2 id="&#x521B;&#x5EFA;&#x6808;&#x5E27;"><a name="&#x521B;&#x5EFA;&#x6808;&#x5E27;" class="plugin-anchor" href="#&#x521B;&#x5EFA;&#x6808;&#x5E27;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x521B;&#x5EFA;&#x6808;&#x5E27;</h2>
<p>&#x901A;&#x5E38;&#x7528;&#x4E00;&#x4E2A;&#x53EB;&#x505A;<code>&#x6808;&#x57FA;&#x5740;</code>&#xFF08;bp&#xFF09;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x6765;&#x4FDD;&#x5B58;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x51FD;&#x6570;&#x6808;&#x5E27;&#x7684;<code>&#x5F00;&#x59CB;&#x5730;&#x5740;</code>&#xFF0C;&#x7531;&#x4E8E;<code>&#x6808;&#x6307;&#x9488;</code>&#xFF08;sp&#xFF09;&#x59CB;&#x7EC8;&#x4FDD;&#x5B58;&#x7684;&#x662F;&#x6808;&#x9876;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x6240;&#x4EE5;<code>&#x6808;&#x6307;&#x9488;</code>&#x4FDD;&#x5B58;&#x7684;&#x4E5F;&#x5C31;&#x662F;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x51FD;&#x6570;&#x6808;&#x5E27;&#x7684;<code>&#x7ED3;&#x675F;&#x5730;&#x5740;</code>&#x3002;</p>
<p><img src="https://image.coder.cat/stack3.png" alt=""></p>
<blockquote>
<p>&#x6BCF;&#x6B21;&#x53D1;&#x751F;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;&#x90FD;&#x8981;&#x4FEE;&#x6539;<code>&#x6808;&#x57FA;&#x5740;</code>&#xFF08;bp&#xFF09;&#x4F7F;&#x5B83;&#x4FDD;&#x5B58;&#x65B0;&#x6808;&#x5E27;&#x7684;<code>&#x5F00;&#x59CB;&#x5730;&#x5740;</code>&#xFF0C;&#x8FD9;&#x5C06;&#x5BFC;&#x81F4;&#x5B83;&#x88AB;&#x8986;&#x76D6;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x4E4B;&#x524D;&#x8BB2;&#x5230;&#x7684;<code>&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x4FDD;&#x5B58;&#x4E0E;&#x6062;&#x590D;</code>&#x4F7F;&#x7528;&#x6808;&#x6765;&#x5BF9;<code>&#x6808;&#x57FA;&#x5740;</code>&#x8FDB;&#x884C;&#x4FDD;&#x5B58;&#x4E0E;&#x6062;&#x590D;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x4E00;&#x5F00;&#x59CB;<code>&#x6808;&#x57FA;&#x5740;</code>&#x548C;<code>&#x6808;&#x6307;&#x9488;</code>&#x90FD;&#x5206;&#x522B;&#x6307;&#x5411;&#x8C03;&#x7528;&#x8005;&#x6808;&#x5E27;&#x7684;<code>&#x5F00;&#x59CB;&#x5730;&#x5740;</code>&#x548C;<code>&#x7ED3;&#x675F;&#x5730;&#x5740;</code>&#xFF0C;&#x521B;&#x5EFA;&#x65F6;&#x9996;&#x5148;&#x5C06;&#x8C03;&#x7528;&#x8005;&#x6808;&#x5E27;&#x7684;<code>&#x5F00;&#x59CB;&#x5730;&#x5740;</code>&#x4E5F;&#x5C31;&#x662F;&#x6B64;&#x65F6;&#x7684;<code>&#x6808;&#x57FA;&#x5740;</code>&#x538B;&#x6808;&#x4FDD;&#x5B58;&#xFF0C;&#x7531;&#x4E8E;<code>&#x6808;&#x57FA;&#x5740;</code>&#x662F;<code>&#x88AB;&#x8C03;&#x7528;&#x8005;&#x4FDD;&#x5B58;</code>&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x5B58;&#x653E;&#x5728;&#x88AB;&#x8C03;&#x7528;&#x7684;&#x6808;&#x5E27;&#x4E2D;&#x3002;</p>
<p>&#x6808;&#x53D8;&#x5316;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p><img src="https://image.coder.cat/stack18.png" alt=""></p>
<p>&#x968F;&#x540E;&#x5C06;<code>&#x6808;&#x57FA;&#x5740;</code>&#xFF08;bp&#xFF09;&#x4FEE;&#x6539;&#x6210;&#x6B64;&#x65F6;<code>&#x6808;&#x6307;&#x9488;</code>&#xFF08;sp&#xFF09;&#x7684;&#x503C;&#xFF0C;&#x4F7F;&#x8FD9;&#x5B83;&#x4EEC;&#x90FD;&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF08;&#x4E0B;&#x9762;&#x5DE6;&#x56FE;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x88AB;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x8FD8;&#x9700;&#x8981;&#x6808;&#x7A7A;&#x95F4;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x628A;<code>&#x6808;&#x6307;&#x9488;</code>&#xFF08;sp&#xFF09;&#x5411;&#x4F4E;&#x5730;&#x5740;&#x79FB;&#x52A8;&#x6765;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#xFF08;&#x4E0B;&#x9762;&#x53F3;&#x56FE;&#xFF09;&#xFF0C;&#x6700;&#x7EC8;<code>&#x6808;&#x57FA;&#x5740;</code>&#x548C;<code>&#x6808;&#x6307;&#x9488;</code>&#x53C8;&#x5206;&#x522B;&#x6307;&#x5411;&#x4E86;<code>&#x88AB;&#x8C03;&#x7528;&#x8005;</code>&#x6808;&#x5E27;&#x7684;<code>&#x5F00;&#x59CB;&#x5730;&#x5740;</code>&#x548C;<code>&#x7ED3;&#x675F;&#x5730;&#x5740;</code>&#x3002;</p>
<p>&#x6808;&#x53D8;&#x5316;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p><img src="https://image.coder.cat/stack19.png" alt=""></p>
<p>&#x6808;&#x5E27;&#x4E2D;&#x5B58;&#x50A8;&#x4E86;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x3001;&#x8FD4;&#x56DE;&#x5730;&#x5740;&#x3001;&#x4FDD;&#x5B58;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x3001;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x56E0;&#x6B64;&#x5B8C;&#x6574;&#x7684;&#x6808;&#x7ED3;&#x6784;&#x53EF;&#x80FD;&#x50CF;&#x4E0B;&#x9762;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="https://image.coder.cat/stack20.png" alt=""></p>
<p><strong>&#x56FE;&#x4E2D;&#x5404;&#x4E2A;&#x90E8;&#x5206;&#x8BF4;&#x660E;&#xFF1A;</strong></p>
<ul>
<li><p>&#x51FD;&#x6570;&#x53C2;&#x6570;&#xFF08;arguments&#xFF09;</p>
<p>&#x5728;<code>X64</code>&#x4E2D;&#x5982;&#x679C;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x8D85;&#x8FC7;6&#x4E2A;&#xFF0C;&#x524D;6&#x4E2A;&#x901A;&#x8FC7;&#x5BC4;&#x5B58;&#x5668;&#x8FDB;&#x884C;&#x4F20;&#x9012;&#xFF0C;&#x5176;&#x4F59;&#x53C2;&#x6570;&#x5219;&#x901A;&#x8FC7;&#x6808;&#x6765;&#x8FDB;&#x884C;&#x53C2;&#x6570;&#x4F20;&#x9012;&#xFF0C;&#x5F53;&#x5C11;&#x4E8E;&#x7B49;&#x4E8E;6&#x4E2A;&#x6216;&#x6CA1;&#x6709;&#x53C2;&#x6570;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x8BE5;&#x6808;&#x5E27;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x3002;</p>
<p>&#x5728;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x6808;&#x6765;&#x4F20;&#x9012;&#x53C2;&#x6570;&#x65F6;&#xFF0C;<code>&#x8C03;&#x7528;&#x51FD;&#x6570;</code>&#x9700;&#x8981;&#x5148;&#x5C06;&#x53C2;&#x6570;&#x538B;&#x5165;&#x81EA;&#x5DF1;&#x7684;&#x6808;&#x5E27;&#x4E2D;&#xFF0C;&#x7136;&#x540E;<code>&#x88AB;&#x8C03;&#x7528;&#x51FD;&#x6570;</code>&#x4ECE;<code>&#x8C03;&#x7528;&#x51FD;&#x6570;</code>&#x7684;&#x6808;&#x5E27;&#x4E2D;&#x5BF9;&#x53C2;&#x6570;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#x3002;&#x6240;&#x4EE5;&#x56FE;&#x4E2D;&#x53C2;&#x6570;&#x90E8;&#x5206;&#x5728;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x7684;&#x6808;&#x5E27;&#x4E2D;&#x3002;</p>
</li>
<li><p>&#x8FD4;&#x56DE;&#x5730;&#x5740;&#xFF08;ret addr&#xFF09;</p>
<p>&#x5C06;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x538B;&#x6808;&#x4E4B;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x628A;&#x8C03;&#x7528;&#x4F4D;&#x7F6E;&#x5904;&#x7684;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x5730;&#x5740;&#x538B;&#x6808;&#xFF0C;&#x4EE5;&#x4FBF;&#x88AB;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x6267;&#x884C;&#x5B8C;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x56DE;&#x5230;&#x539F;&#x6765;&#x7684;&#x4F4D;&#x7F6E;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#xFF0C;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x5C31;&#x662F;&#x8FD4;&#x56DE;&#x5730;&#x5740;&#x3002;</p>
</li>
<li><p>&#x4FDD;&#x5B58;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#xFF08;saved regs&#xFF09;</p>
<p>&#x8FD9;&#x91CC;&#x5B58;&#x653E;&#x7684;&#x662F;&#x9700;&#x8981;<code>&#x88AB;&#x8C03;&#x7528;&#x8005;</code>&#x6765;&#x4FDD;&#x5B58;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x4F8B;&#x5982;<code>&#x65E7;&#x7684;&#x6808;&#x57FA;&#x5740;</code>&#xFF08;old bp&#xFF09;&#x65E7;&#x4FDD;&#x5B58;&#x5728;&#x5176;&#x4E2D;&#x3002;</p>
</li>
<li><p>&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF08;local vars&#xFF09;</p>
<p>&#x8FD9;&#x4E2A;&#x90E8;&#x5206;&#x662F;&#x5B58;&#x50A8;&#x5728;&#x6808;&#x4E2D;&#x800C;&#x4E0D;&#x662F;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x5982;&#x679C;&#x51FD;&#x6570;&#x6CA1;&#x6709;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x6216;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x90FD;&#x5B58;&#x50A8;&#x5728;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x6808;&#x5E27;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x3002;</p>
</li>
</ul>
<p><strong>&#x5982;&#x679C;&#x518D;&#x6B21;&#x53D1;&#x751F;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF0C;&#x90A3;&#x5C31;&#x91CD;&#x590D;&#x6574;&#x4E2A;&#x521B;&#x5EFA;&#x6808;&#x5E27;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;&#x9012;&#x5F52;&#x51FD;&#x6570;&#x6765;&#x8BF4;&#x548C;&#x666E;&#x901A;&#x51FD;&#x6570;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x3002;</strong></p>
<h2 id="&#x9500;&#x6BC1;&#x6808;&#x5E27;"><a name="&#x9500;&#x6BC1;&#x6808;&#x5E27;" class="plugin-anchor" href="#&#x9500;&#x6BC1;&#x6808;&#x5E27;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x9500;&#x6BC1;&#x6808;&#x5E27;</h2>
<blockquote>
<p>&#x5728;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x65F6;&#x4F1A;&#x628A;&#x4E4B;&#x524D;&#x7ED9;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x7684;&#x6808;&#x5E27;<code>&#x9500;&#x6BC1;</code>&#xFF0C;&#x4EE5;&#x91CA;&#x653E;&#x7A7A;&#x95F4;&#x3002;</p>
</blockquote>
<p>&#x9500;&#x6BC1;&#x65F6;&#x5148;&#x628A;<code>&#x6808;&#x6307;&#x9488;</code>&#xFF08;sp&#xFF09;&#x79FB;&#x52A8;&#x5230;&#x6B64;&#x65F6;<code>&#x6808;&#x57FA;&#x5740;</code>&#xFF08;bp&#xFF09;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x6B64;&#x65F6;<code>&#x6808;&#x6307;&#x9488;</code>&#x548C;<code>&#x6808;&#x57FA;&#x5740;</code>&#x90FD;&#x6307;&#x5411;&#x540C;&#x6837;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x6808;&#x53D8;&#x5316;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p><img src="https://image.coder.cat/stack5.png" alt=""></p>
<p>&#x73B0;&#x5728;&#x6808;&#x9876;&#x521A;&#x597D;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x521B;&#x5EFA;&#x6808;&#x5E27;&#x65F6;&#x4FDD;&#x5B58;&#x7684;&#x8C03;&#x7528;&#x8005;<code>&#x6808;&#x5E27;</code>&#x7684;<code>&#x6808;&#x57FA;&#x5740;</code>&#xFF0C;&#x73B0;&#x5728;&#x628A;&#x5B83;&#x51FA;&#x6808;&#x81F3;<code>&#x6808;&#x57FA;&#x5740;</code>&#xFF08;bp&#xFF09;&#xFF0C;&#x5F97;&#x5230;&#x4E0B;&#x56FE;&#x4E2D;&#x7684;&#x6808;&#x7ED3;&#x6784;&#xFF1A;</p>
<p><img src="https://image.coder.cat/stack7.png" alt=""></p>
<p>&#x5230;&#x76EE;&#x524D;&#x4F4D;&#x7F6E;<code>&#x88AB;&#x8C03;&#x7528;&#x8005;</code>&#x7684;&#x6808;&#x5E27;&#x5DF2;&#x7ECF;&#x88AB;&#x9500;&#x6BC1;&#x7A7A;&#x95F4;&#x5F97;&#x5230;&#x91CA;&#x653E;&#xFF0C;&#x4F46;&#x662F;&#x51FD;&#x6570;&#x7684;&#x8FD4;&#x56DE;&#x6B65;&#x9AA4;&#x5E76;&#x6CA1;&#x6709;&#x5B8C;&#xFF0C;<code>&#x8C03;&#x7528;&#x8005;</code>&#x7684;&#x6808;&#x5E27;&#x4E2D;&#x8FD8;&#x4FDD;&#x5B58;&#x8005;<code>&#x8FD4;&#x56DE;&#x5730;&#x5740;</code>&#xFF0C;&#x6B64;&#x65F6;&#x9700;&#x8981;&#x628A;<code>&#x8FD4;&#x56DE;&#x5730;&#x5740;</code>&#x51FA;&#x6808;&#x81F3;<code>&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;</code>&#xFF08;PC&#xFF09;&#x4EE5;&#x6062;&#x590D;&#x5230;&#x539F;&#x6765;&#x7684;&#x4F4D;&#x7F6E;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#xFF0C;&#x8FD4;&#x56DE;&#x540E;&#x7684;&#x6808;&#x5E27;&#xFF1A;</p>
<p><img src="https://image.coder.cat/stack6.png" alt=""></p>
<p><strong>C/C++&#x4E2D;&#x9500;&#x6BC1;&#x6808;&#x5E27;&#x5E76;&#x4E0D;&#x4F1A;&#x6E05;&#x7A7A;&#x88AB;&#x9500;&#x6BC1;&#x6808;&#x5E27;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x3002;</strong></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="storage-of-local-variables.html" class="navigation navigation-prev " aria-label="Previous page: 局部变量的存储">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="c-stack-frame-example.html" class="navigation navigation-next " aria-label="Next page: C语言函数栈帧实例">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"函数栈帧","level":"1.8","depth":1,"next":{"title":"C语言函数栈帧实例","level":"1.9","depth":1,"path":"content/c-stack-frame-example.md","ref":"content/c-stack-frame-example.md","articles":[]},"previous":{"title":"局部变量的存储","level":"1.7","depth":1,"path":"content/storage-of-local-variables.md","ref":"content/storage-of-local-variables.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","search","-sharing","anchors","highlight","code","hide-element","disqus"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"disqus":{"useIdentifier":false,"shortName":"codercat-gitbook"},"github":{"url":"https://github.com/acodercat/function-call-principle"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":false},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"anchor-navigation-ex":{"isRewritePageTitle":false},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"anchors":{}},"theme":"default","author":"codercat","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"函数调用原理","language":"zh-hans","gitbook":"*"},"file":{"path":"content/function-stack-frame.md","mtime":"2020-12-25T04:02:15.020Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-01-07T03:49:58.931Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

